Repository: GamemakerChina/GMS_articles_translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Phobia sources: Anything commonly associated with a phobia, such as spiders, guns, or knives, can suggest harm or threat.
zh_cn: 恐惧来源：:任何能产生恐惧的东西，如蜘蛛、枪或刀，都可能暗示伤害或威胁。.

source: Places that fill basic needs, including food, rest, warmth, and opt-in sociability.
zh_cn: 能够满足基本需求的场所，这些需求例如食物，休息，温暖和一点社交

source: Places that support low-demand companionship, such as those with calm pets, or passive NPC-watching.
zh_cn: 不需要玩家过多操作的地方，例如养着安静动物的地方，或只需静静看着NPC的地方。

source: Places where players can decorate can become cozy as it suits the player’s taste and expression, and players may seek out cozy environments as a way of changing pace in contrast to more demanding environments.
zh_cn: 如果玩家能按自己的意愿装饰某处地方，那么这处地方也将是舒适的，因为玩家可以表达自己，把这些地方装饰得符合自己的审美，玩家借此可以让环境更加舒适，而不是相反。.

source: Places with enclosed, strongly seasonal identities will also evoke coziness
zh_cn: 密闭的，有很强季节性的地点也是舒适的重要因素。

source: Players are willing to play beyond satisfying their core motivations.
zh_cn: 玩家更愿意在玩乐时同时满足他们的内在动机。

source: Players don’t need to worry about the high stress, immediate trials of mere survival and can instead put their attention towards the delicate work of becoming a better person.
zh_cn: 玩家不用担心高压力，也不用担心眼下的生存，从而可以把把他们的注意力都放到如何成为一个更好的人这样充满奥妙的问题上。

source: Players let their guard down.
zh_cn: 玩家不用时刻警惕。

source: Players of cozy games likely score highly on conscientiousness and agreeableness.
zh_cn: 舒适游戏的玩家更有可能在尽责和愉快的情况下获得高分。

source: Players seek to fulfill their emotional and psychological needs within games.
zh_cn: 玩家寻求在游戏中满足他们的情感和心理需求。

source: Players that reciprocate tend to escalate the depth of their relationship.
zh_cn: 这样玩家会倾向于加深和别人的关系。

source: Players who seek out comfy games are not usually looking for conflict or stressful interactions.
zh_cn: 玩舒适游戏的玩家通常不会想要冲突或充满压力的体验。

source: Politeness: We are nice to one another.
zh_cn: 礼貌：我们都是很nice的人。

source: Politeness: When politeness is thoughtful and kind, it can be cozy, but politeness can also be taken to an extreme, becoming insincere or passive-aggressive, which is anti-cozy.
zh_cn: 礼貌: 当礼貌是体贴和善良的时候，它可以是舒适的，但礼貌也可以被带到一个极端，变得不真诚而消极好斗，这样也是不舒适的。

source: Positive Emotes: Have a curated emote system that focuses on positive signals such as smiling or waving.
zh_cn: 正能量：有一个能让玩家表达自己积极信号（例如微笑和点头致意）的系统。

source: Posture and animations that emphasize relaxation and contentment can model a cozy mood.
zh_cn: 放松或惬意的动作或姿势能让玩家感到舒适。

source: Protection from threat: If there’s a threat, the community is a safe haven.
zh_cn: 防范威胁：社区会联手帮助玩家抵御威胁。

source: Putting on cozy socks (and wiggling your toes)
zh_cn: 穿上舒适的袜子，并扭动脚趾

source: Quantic Foundry’s motivation profiles: After survey over 300,000 game players, this group found six main motivational categories such as Action, Social, Mastery, Achievement, Immersion and Creativity.
zh_cn: Quantic Foundry的动机简介：:在调查了30多万游戏玩家后, 该小组发现了六个主要的激励类别，包括行动、社交、掌握技能、成就、沉浸体验和创造力。

source: Reading a book
zh_cn: 品味一本书

source: Real safety is cozier than reading about someone who is safe.
zh_cn: 真实的安全感比在书上读到某人很安全更令人舒适。

source: Realm of the Mad God was a permadeath MMO and Alphabear is a cozy, cute word game.
zh_cn: 《狂神国度》是一款永恒的MMO游戏，而《阿尔法熊》则是一款舒适、可爱的文字游戏。

source: Refuge & Escape: if there is an “outside” to this space, it is contrasted in its discomfort or danger.
zh_cn: 避难和逃生：如果这个地方 有一个 “外部”的空间能与之相比，那么后者的不适和危险能和前者形成鲜明对比。.

source: Relaxed: The activity is low mental cost.
zh_cn: 放松：这个活动不会消耗你太多的精力。

source: Repeated low risk tasks allow the player to relax.
zh_cn: 重复低风险的任务可以让玩家方式。

source: Reputation flags or banservers end up creating culture where bad behavior is acceptable.
zh_cn: 声望系统的封禁系统会让不良行为被看作是可以接受的。

source: Responsibility: Responsibility requires emotional labor: the effort to plan, think, and execute on a plan to resolve something.
zh_cn: 责任：责任需要脑力劳动：努力制定计划，思考并执行计划来解决问题。

source: Ritual: Facilitating repeated, meaningful actions can create familiarity and contentedness.
zh_cn: 重复：: 鼓励重复却有意义的活动能增强熟悉性和满足感。

source: Romance: Cozy spaces often facilitate intimacy and a deepening of emotional connection, but romance opens a field to any number of aggressive or risky social encounters.
zh_cn: 浪漫: 舒适的空间往往有利于亲密的情感进一步深化，但浪漫为大量的极具攻击性或冒险性的社会接触打开了大门。

source: SDT proposes that people thrive when they are able to pursue intrinsic motivations such as Autonomy, Competence and Relatedness.
zh_cn: SDT 提出，当人们能够追求诸如自主、能力和人际关系等内在动机时，他们就会茁壮成长。

source: Safe: The activity is known to be safe and will not cause stress or danger.
zh_cn: 安全：这个活动是安全的不会带来任何风险的。

source: Safety in the storm - Dark Souls campfire
zh_cn: 暴风雨中的宁静——《黑魂》中的篝火

source: Safety: A cozy game has an absence of danger and risk.
zh_cn: 平安： 舒适游戏没有威胁或风险。

source: Searching or collecting for diamonds, berries or fossils -- though not under duress.
zh_cn: 自愿地寻找售价钻石，浆果或化石

source: Seasons: The visual passing of seasons is heavily connoted with coziness in their familiarity and rituals, often of community and abundance.
zh_cn: 季节：季节的转换和人们是否因为感到熟悉而舒适密切相关，很多人都能感觉这种丰富的变化。

source: Second, we see games as a means of satisfying unmet needs: The human animal is motivated to fulfill various needs.
zh_cn: 其次, 我们认为游戏是满足人们需求的一种方法：人类作为一种动物有满足各种需求的动力。

source: Self determination Theory: As we covered above, people are intrinsically motivated to pursue Autonomy, Competence and Relatedness.
zh_cn: Self determination Theory: 正如我们上面所介绍的，人们有内在的动力去追求自主、能力提升和与别人的练习。

source: Service existing needs.
zh_cn: 服务已存在的需求.

source: Shelters from storms, roofs from rain or harsh sun, or even a garden inside a bustling city make a place of everyday self-care.
zh_cn: 风暴里的避风港，烈日或大雨下的一个屋顶，或繁华都市内一隅宁静的花园，都是和内心独处的好地方。.

source: Signal social context automatically: For example, a scene can shift to low light intimate colors if two people are chatting but shift to bright colors if lots of people are talking.
zh_cn: 根据社交状况变换的环境：如果只是两个人在呢喃细语，可以将灯光调弱，调成暧昧的颜色。如果是一群人在讨论，就把灯光调的明亮一些。

source: Simple interactions should reinforce that the characters have their own inner lives separate from the player’s agenda.
zh_cn: 简化的互动应该是玩家自己内心想要的，应该和游戏中的任务分开。

source: Since coziness is an opt-in affordance, any player activity driven by extrinsic motivation - either as requisite responsibility or threat-response, or as an artificial reward - tends to evoke an un-cozy experience.
zh_cn: 因为舒适必须是让玩家主动来体验的，任何由外部因素迫使玩家做的某些事——无论是他们的责任还是对为了反抗威胁，或是为了某种奖励，都会让玩家觉得不自在，他们在做这件事时感不到任何乐趣。

source: Small World: Many small world games have a very manageable scope and smallness that generates a cozy feel, but small worlds can also be threatening, needy, or intense.
zh_cn: 小小世界：许多微型世界的范围都很小，易于控制，这能产生舒适感。尽管这也可能产生威胁，需求或紧张。

source: Small cooperative groups can facilitate escalation: Encourage dense, frequent interactions between small groups of players.
zh_cn: 合作小组能加深组员之间的感情：鼓励小组内的玩家经常在一起互动。

source: Smooth Transitions: Gentle gradients between states, colors, or environments within the cozy area.
zh_cn: 平滑过渡：舒适区域内温和的状态，颜色和环境。.

source: So as a designer, it is incredibly important to understand what motivations your players are pursuing and how your game design helps them practice mastery related to their needs.
zh_cn: 因此, 作为一名设计师, 了解玩家的动机，以及游戏设计如何帮助他们练习相关技能并满足他们的需求是非常重要的。

source: So games do some pieces of coziness well and others poorly.
zh_cn: 所以，游戏在有些方面很舒适，在其它方面没那么好。

source: Sociable yet private, discrete 3rd spaces separate from responsibility or ‘work’: bars, cafes, retreats, libraries, cabins, gardens
zh_cn: 既是社交性有时私密性的， 独立于“工作”和“责任”的第三空间：酒吧，咖啡馆，招待所，图书馆，小屋，花园。

source: Social comparison creates social anxiety for some players.
zh_cn: 如果你把玩家和游戏世界中其它NPC比较，那么会为其中一些玩家带来紧张感。

source: Social norms spread: In multiplayer contexts, players will watch one another and adopt shared social norms based off how people are reacting to the game.
zh_cn: 社会规范传播：在多人的背景下，玩家会关注彼此，根据别人对游戏的反应来采用共同的社会规范。

source: Social norms to aim for: When designing a cozy community, ask yourself what social systems and signals you’ve put in place that encourage the following community norms.
zh_cn: 社会规范的目标：当你想要创建一个舒适的社区时，你得看看社区中是否有这些信号或系统，这些系统能鼓励良好的社会准则：

source: Soft and cuddly appearance that invites hugging, like a Totoro
zh_cn: 温柔而可爱的外表，似乎是希望和你相拥。就像 Totoro。

source: Soft stimuli implies authenticity, sincerity, and humanity.
zh_cn: 软刺激意味着真实，真诚和人性。

source: Softness: Cozy games use strong aesthetic signals that tell players they are in a low stress environment full of abundance and safety.
zh_cn: 轻柔：舒适游戏使用强烈的审美信号，来告诉玩家他们在一个低压力的，富有且安全的环境中。

source: Some mechanics are emotionally more in tune with coziness, but any game can be made more cozy.
zh_cn: 有些游戏机制在感情处理上更加舒适，但是任何游戏都能变得更加舒适。

source: Some mechanics may start off as cozy, but later become reduced or compromised as players acclimate to gameplay systems and (consciously or subconsciously) seek to min/max them.
zh_cn: 有些游戏机制可能在开始时是很舒适的，但后来却被削弱，

source: Some members of the group will naturally opt-in to deep relationships.
zh_cn: 某些组员也会因为志趣相投而产生更坚固的友谊。

source: Some player activities can achieve a sense of coziness due to their familiarity.
zh_cn: 某些玩家活动会因为熟悉而变得舒适。

source: Some scarcity and social comparison is okay if done in moderation.
zh_cn: 如果能适当处理缺乏感和社会竞争，那么它们也能提供舒适感。

source: Space: Closer, intimate, more enclosed spaces.
zh_cn: 空间：: 封闭的有限的空间。

source: Spaces can become cozy once danger is no longer present: an arena where a boss fight used to be can become a cozy playground for celebration and bonding, or a cozy environment can be a goal for exploring part of a map.
zh_cn: 当危险不复存在，空间就将变得舒适起来：以前和老板争得面红耳赤的地方，现在可以用来庆祝或开宴会。或者是地图上原来未知的地方，经过探索后也会变得舒适。

source: Spry Fox ran two games with two very different communities.
zh_cn: Spry Fox在两个完全不同的社区发布了两款不同的游戏。

source: Stories that lazily drift along the river of time
zh_cn: 慵懒时光中发生的故事

source: Strangers: Due to the logistical challenges of getting friends together in the same time, place and game, online game players tend to be strangers.
zh_cn: 陌生人： 由于在逻辑上来说，在同一时间同一地点很难见到认识的玩家，所以在线游戏中的玩家大多数陌生人。.

source: Streamlined UI: Make the interface for emoting accessible and easy to use.
zh_cn: 简洁的UI：让互动界面简单易用。

source: Taken to the extreme, this can include literal pets or characters who fulfill the same function of a pet, whose function in the game world is to adopted and cared for.
zh_cn: 在极端情况下，这些可能包括真实的宠物，和那些充当宠物的角色，它们的功能是被玩家收养和照顾。

source: Tend and Befriend: This theory suggests many humans are motivated to bond with one another for safety and strength.
zh_cn: Tend and Befriend:这个理论认为，许多人为了更加安全和更有力量，而有相互联系的动机。.

source: Terraria’s room requirements and mechanics encourage cozy placements of lighting and doors to keep out threats and protect allies.
zh_cn: 《泰勒瑞拉》的对制作房间的要求和游戏机制鼓励玩家在能令他们感到舒适的地方放置灯和门，这样能保护他们伙伴和抵御危险。

source: Thank you so much for reading,
zh_cn: 谢谢阅读。

source: The Atelier games frame the fantasy around career, community, and cozy objects/spaces
zh_cn: 《Atelier》游戏围绕职业、社区和舒适的物体和空间让玩家自由想象

source: The Sad Exception of The Sims Online: The Sims Online was a potentially cozy game dominated by a community of sociopaths.
zh_cn: 《模拟人生网络版》令人伤心的例外：《模拟人生在线》是一款本来应该是一款舒适游戏,，它是由反社会者组成的社区主导的。.

source: The Witcher 3 uses warm, yellow tones in its lighting and materials to make their taverns feel even more welcoming.
zh_cn: 《巫师3》在他们的灯光和材质中使用了温暖的黄色色调，这样看起来这款游戏很欢迎玩家。

source: The Zelda series often offers cozy house interiors, literally blocking any sense of an outside world that could interfere.
zh_cn: 《塞尔达系列》的房子内饰看起来是非常舒适轻松的，几乎不让外界元素有干扰的可能。.

source: The assumption was that people who enjoyed games predominantly enjoyed competition.
zh_cn: 人们认为喜欢游戏的人主要是享受竞争。

source: The best practice here is twofold
zh_cn: 这里的最佳实践有两方面

source: The calm before the storm - Ellie’s guitar or giraffes in The Last of Us
zh_cn: 暴风雨之前的的宁静——《美国末日》中Ellie的吉他和长颈鹿。

source: The challenge of cozy monetization
zh_cn: 舒适货币化

source: The challenge of emergent extrinsic rewards
zh_cn: 突然的有回报的外部挑战

source: The closer coziness gets to a real world situation with real people and honest human pleasures, the stronger the impact.
zh_cn: 当

source: The community is willing to lend a shoulder to cry on.
zh_cn: 他们只需要别人对他说：”别害怕，一切都会好起来的“。

source: The community supports this.
zh_cn: 大家都会鼓励和他人友好相处的行为。

source: The coziest space will not feel cozy if a player enters it with pressing external needs.
zh_cn: 如果玩家是被外部因素强迫来到舒适空间时，他们是不会感到舒适的。

source: The coziness of these gestures is amplified when the acts are non-transactional.
zh_cn: 当这些动作是出自内心而非为了利益时，这些行为会更让玩家感到舒适。

source: The cozy alternative is to implement abundance, safety, and reprieve to foster cooperative and trustful interactions.
zh_cn: 舒适的原则是给玩家带来富有感，安全感和舒缓感，以此来促进他们的团结和信任。

source: The current dominant multiplayer design pattern uses limited resources, high stakes, and hazardous worlds to drive competitive behavior between players.
zh_cn: 目前大多数游戏用有限的资源和高度危险的世界来迫使玩家相互竞争。

source: The eyes at a distance make the fire feel even cozier.
zh_cn: 远处怪物的眼睛让篝火看着更加舒适。

source: The game promotes social norms that promise and encourage trust.
zh_cn: 游戏提倡良好的社会规范，鼓励互相信任。

source: The intrinsic reward for engaging with cozy characters is a sense of belonging in the community, possibly, but not necessarily, building to friendship or romance.
zh_cn: 和社区中的舒适角色互动能让你感到归属感，甚至建立起友谊甚至爱情。

source: The opportunity to fight off attackers might not exist in a person’s day-to-day desk job, but a game lets them practice those skills safely and easily.
zh_cn: 就好像你不可能边在公司上班边击退恐怖袭击者。但游戏可以让他们安全轻松地练习这些技能。

source: The optimal strategy in these environments is to see other strangers as enemies who must be avoided or destroyed.
zh_cn: 在这些游戏中，你必须把陌生人视为敌人，用各种方法消灭他们。

source: The players in Realm of the Mad God met most typical MMO player stereotypes, with a tendency to become quite angry with both developers and one another.
zh_cn: 《狂神国度》中的玩家遇到了最呆滞的MMO玩家对手，前者往往对开发者和对手都非常生气。

source: The process of negating coziness: Because many common game mechanics are derived from satisfying lower order needs, it is very easy to accidentally disrupt the player’s feeling of coziness.
zh_cn: 破坏舒适感的过程: 由于许多常见的游戏机制都是用于于满足较低层次的需求，因此很容易破坏玩家的舒适感。

source: The resulting pro-social environment can shift players attitudes positively towards other players.
zh_cn: 如此亲和而温馨的社会能让玩家对游戏和其他人的态度变得富有正能量。

source: The same pattern is used in Stardew Valley and Harvest Moon.
zh_cn: 在《星露谷物语》和《牧场物语》中都是这样的。

source: The scale of the objects, architecture, and other creatures are comfortable for humans.
zh_cn: 用品，建筑和其它生物的大小都是以人为中心设计的，人类因此会感到很舒适。

source: The sources of both music and audio should ideally be diegetic to allow the players to connect concretely or even intimately with those sources.
zh_cn: 游戏中音乐和声效的源头应该都在游戏地图内，这样玩家能精确或至少大概知道声音的信息。

source: The theoretical opt-in that occurs at the systems level is more rote than intentional.
zh_cn: 在机器系统层面上发生的选择更多的是机械的, 而不是经过深思熟虑的。

source: Their agency around being able to explore and appreciate a game in their own way is lost.
zh_cn: 他们将不能以自己喜欢的方式去探索和欣赏这个游戏。

source: Their sympathetic nervous system kicks, adrenaline floods the body, and memory suffers.
zh_cn: 他们的交感神经系统兴奋，肾上腺素泛滥全身，记忆力受损。

source: Thematically, it had elements of coziness with pleasant house in friendly neighborhoods.
zh_cn: 从主题上来说，这款游戏的元素都很舒适，比如令人愉快的房子和友好的邻居。

source: There are many mundane objects from the cozy items list above are associated with low risk activities.
zh_cn: 上述能够让人感到舒适的项目都和寻常，低风险有关。

source: There are many of these related to gender, race, age and class.
zh_cn: 这其中的问题有许多与性别、种族、年龄和阶级有关。

source: There’s a long history of match-based competitive games such as Chess or Soccer derived from zero-sum systems.
zh_cn: 许多有悠久历史的竞技游戏，比如国际象棋和足球，都是从零和系统中产生的。

source: There’s a risk with use overly strong extrinsic rewards, but simply signposting the activity is often enough.
zh_cn: 那么你只需要仅告诉玩家这些行为是友善的就行了，如果你用高额回报引诱玩家这么做，是很危险的。

source: There’s a simple process at play here:
zh_cn: 这儿有一个简单的过程在起作用：

source: There’s an inherent joy to making games that help players explore their higher order needs.
zh_cn: 舒适游戏能帮助玩家探索他们更高层次的需求，制作这样的游戏通常有一种内在的乐趣。

source: There’s no official start or stop to a match.
zh_cn: 足球比赛没有明确的开始或截止时间。

source: There’s often an intimacy of space and emotion, with a slower tempo pace and manageable scope (spatially, emotionally, and otherwise).
zh_cn: 在空间和情感上有亲密感，并且节奏速度较慢，范围可控（空间，情感和其他方面）。

source: These antisocial characters give a community authenticity; like a patchwork quilt, mismatched scraps add to the charm.
zh_cn: 这些反社会的家伙让社会更加真实：就像缝制的的被子，不完美的残片却又无穷的魅力。

source: These are gentle and comforting stimulus, where players have a lower state of arousal but can still be highly engaged and present.
zh_cn: 这些是温和而舒适的刺激，玩家不会想面对强敌那样亢奋，但仍然高度参与和存在。

source: These high level principles provide direction and framing for designing a cozy or cozier game.
zh_cn: 这些高级原则为设计舒适或比较舒适的游戏提供了方向和框架。

source: These materials are familiar, implying either sturdy, ancestral safety or physical comfort.
zh_cn: 这些材质是熟悉的，

source: These materials can be harder to find in science fiction worlds, making them more likely to feel sterile, unwelcoming, and uncomfortable.
zh_cn: 这些材质很难在科普或科幻小说中找到，这让这些高科技产物看起来是不能和自然和谐生存，不太舒适的。

source: These motivations are the exact opposite of dog-eat-dog, fend-for-yourself gameplay.
zh_cn: 这些动机和狗之间相互残害的动机，以及只顾自己享乐的动机完全不同。

source: These worlds inherently are low stress, low disappointment, and therefore less likely to have explicit churn triggers.
zh_cn: 舒适游戏的世界本质上是低压力，难失望的，因此不会有明显的让玩家游玩的动机。

source: They are often nurturers, providing affection, shelter, food, companionship, and acceptance.
zh_cn: 他们往往是哺育者，为玩家提供住所和食物，让玩家感受到亲情和被接受感。

source: They can do the heavy lifting of emotional labor for the player.
zh_cn: 他们可以为玩家做一些繁重的情感劳动。

source: They should include visible places to comfortably sit, eat, drink, and view beauty.
zh_cn: 它们包括可以舒适地坐着、吃东西、喝饮料和观赏美景的场所.

source: They stop thriving when they are presented with extrinsic motivators that suck up their attention.
zh_cn: 当他们面对吸引他们注意力的外部激励因素时，他们就会停止发展。

source: Things that are cute but low-intensity can be cozy: elaborate costumes and skins may be too laden with status or opulence, but simpler or understated styles can feel less threatening or attention-seeking.
zh_cn: 可爱但强度较低的东西可以是舒适的：奢华的服装和装饰看起来像是炫富和显摆，但要是使用简约风看起来对别人的压力就不会那么大，也不会太吸引注意力。

source: Things which are too small or too large intrude on coziness with feelings of unbelonging, claustrophobia or agoraphobia.
zh_cn: 过大或过小的事情都会导致玩家的不信任感，某些玩家还可能对过于幽闭或开放的空间感到恐惧。

source: Think about creating warm and welcoming spaces for the team members when they aren’t fighting.
zh_cn: 当不在作战时，尝试为他们创建一个温暖舒适的空间。

source: This also means that there is no single defining genre that is “coziness”.
zh_cn: 这也意味着并没有哪种游戏是只能被定义为“舒适”的。

source: This can be mitigated by context: for instance, the presence of a knife in order to cook or perform other nurturing activities, especially if it cannot be used for violence.
zh_cn: 但是这可以通过背景信息来减轻：例如刀的出现并不是用于暴力，而是用来切菜做饭。

source: This can manifest through the character’s role, their aesthetics, and the affordances of interaction offered the player.
zh_cn: 这可以通过角色的行为，他们的审美观，以及在和他们与玩家互动时的表现来体现。

source: This can manifest with roles traditionally roles traditionally associated with cozy places - bartenders, innkeepers, librarians, farmers, grandmothers, spouse, etc.
zh_cn: 这些从传统上来说就是那些和舒适场所相关的角色——调酒师、客栈老板、图书馆员、农民、祖母、配偶等。

source: This design process is at the heart of making an engaging game.
zh_cn: 这个设计过程是制作引人入胜的游戏的核心。

source: This document is divided into three parts with the aim of getting you introduced to the interface and basic workings of GameMaker Studio 2 before going on to more advanced usage and the functions available through our propriety scripting language GML or our visual scripting tool Drag and Drop.
zh_cn: 这个文档分成了三个部分，以便更好的给你介绍 GameMaker Studio 2的界面和基础工作。 before going on to more advanced usage and the functions available through our propriety scripting language GML or our visual scripting tool Drag and Drop.

source: This effect can also be achieved by steady hums or noises, such as from fans or machinery.
zh_cn: 这种效果也可以通过稳定的嗡嗡声或噪音来实现，例如来自风扇或机械的噪音。（译者注：试想一下，你在雨夜通常睡得很舒服，就是这种原理。）

source: This enabled mafia-esque gangs to enforce coercive social structures like protection rackets.
zh_cn: 这使得黑手党式的帮派能够干勒索保护费之类的勾当。

source: This ends up being a cozy moment of opt-in social fun.
zh_cn: 这个踢足球游戏最终会变成一个可以享受社交乐趣的悠闲时刻。

source: This immediately puts safety on the back burner.
zh_cn: 这等于将安全放在了次要位置。（？？）

source: This incrementally creates familiarity, recognition, sense of shared experience (all cozy factors).
zh_cn: 这会让他们逐渐熟悉，认可，共享经验以及其它舒适的因素。

source: This is a very warm and welcoming opening and creates a safe opportunity to opt-out.
zh_cn: 这是热情欢迎别人的行为，但别人也可以自主选择不参与而不用感到内疚。

source: This may seem self evident, but it has a huge impact on community relations.
zh_cn: 这似乎是不言而喻的，但它对社区关系有着巨大的影响。

source: This mimics what we do in real life.
zh_cn: 这模仿了我们在现实生活中所做的事情。

source: This results in fewer failed reciprocation loops.
zh_cn: 这样能减少社会环境的恶性循环。

source: This ties back into play as practice.
zh_cn: 这把游戏和实践相关联。

source: This welcome does not imply responsibility or pressure on them as a hero or other job to perform, but rather welcomes them as a person, to join whatever activities are available, or to be alone, as they wish.
zh_cn: 这种欢迎并不要求他们去当英雄，或者去做其他他们应当做的工作。相反，这是欢迎他们参加任何活动，或者仅仅是独处不受干扰。

source: This works.
zh_cn: 这很有效。

source: Though this reaction does exist, humans seem to have a far richer set of behavioral responses not captured in this theory.
zh_cn: 尽管这种反应确实存在，但人类似乎有一组在这一理论中没有捕捉到的更丰富的行为反应。

source: Thresholds, however, between cozy & uncomfortable or even dangerous spaces may be more satisfying if distinct when seen and/or crossed, such as coming in from a snowstorm into a log cabin, or ducking into a cave behind a waterfall.
zh_cn: 然而，当你费劲艰辛才来到舒适的地方时，例如逃出雪灾而躲进温暖的小屋，或者跳进瀑布后面的洞穴（译者注：孙大圣便是很好的一个例子），你会感到更加畅快惬意。

source: Time pressure on sales and event generates a fear of missing out.
zh_cn: 限时活动或限时促销会让人们产生一种害怕自己错过什么的感觉。

source: To maximize safety, activities should be voluntary and opt-in so that players never feel the threat of coercion.
zh_cn: 为了最大限度地提高安全性，游戏活动应该是玩家自愿选择加入的，这样玩家就不会感受到强迫的威胁。

source: Tom Nook in Animal Crossing: New Leaf traffics in most of the crass aspects of capitalism.
zh_cn: Tom Nook在《动物之森：新叶》中讲述了资本主义的大部分阴暗之处。

source: Tools for creating norms: There are systems worth adding to facilitate social norms.
zh_cn: 创建社区规范的方法：在推动社会规范时有一些很好的方法。

source: Tools for low cost reciprocity:
zh_cn: 可以用来促进低成本社会互助的工具：

source: Transition spaces without danger or obligation: trains, backseat of a car, slow-moving spacecraft
zh_cn: 没有危险且自己不需要负责的交通工具：火车，汽车后座，慢慢移动的航天器

source: Troublesome behavior like insincerity, perceived or real, ruin the coziness of a player’s experience.
zh_cn: 令人烦恼的行为，如不真诚，感知的或真实的，破坏了玩家体验的舒适感。

source: Two models helps us understand how coziness yields meaningful gameplay.
zh_cn: 有两个模型可以帮助我们更好地了解舒适如何产生有意义的游戏玩法。

source: Typing on a clacky typewriter in a warm wood paneled study (with flakes of snow outside)
zh_cn: 在温暖的木屋中用一台吱嘎作响的打字机打字，木屋外面是鹅毛大雪

source: Undertale uses warm tones, focused interiors, and the presence of a relaxed guardian character to indicate this space is safe and cozy.
zh_cn: 《传说之下》采用温暖的色调，注重游戏内在，以及不用紧张工作的守卫，来告诉玩家游戏世界是安全和舒适的。

source: Unpleasant distractions: Distractions such as notifications, sudden noises or nagging remove a player’s autonomy over their focus.
zh_cn: 令人烦恼的分心：令人分心的事包括通知，突然的声音，或令玩家不能专注的唠叨。

source: Unpretentious community gathering & ritual spaces: farmer’s markets, kitchens, chapels
zh_cn: 朴实无华的社区聚会和举行特定仪式的场所：农贸市场、厨房、教堂

source: Use cozy norms to attract a better community
zh_cn: 用舒适规范来建造更好的玩家社区

source: Use invitations to escalate a relationship: Demand and requests can generate an unpleasant obligation to respond.
zh_cn: 用邀请别人的方法加深感情：需求和提议可能会让他人感到不满。
